Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Type Property
 The material item's type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialItem.MaterialItemTypeEnum Type { get; set; }
Public Property Type As MaterialItem.MaterialItemTypeEnum
	Get
	Set
Property Value
Type: MaterialItem.MaterialItemTypeEnum
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace